# IFC_DMIsEntryEnabled

## Description
Checks if the indicated entry from current IFC Data Mapping is enabled.

```pascal
FUNCTION IFC_DMIsEntryEnabled(
				inStrObjName   : STRING;
				inStrEntryName : STRING): BOOLEAN;
```

```python
def vs.IFC_DMIsEntryEnabled(inStrObjName, inStrEntryName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING|   |
|inStrEntryName|STRING|   |

## Version
Available from: Vectorworks 2017

## Category
* IFC